import { CQ } from "../../../ict-syllabus";

export const cqs: CQ[] = [
  {
    "stem": "একটি কোম্পানির Product ও Sale table থেকে পণ্য বিক্রি ও দামের তথ্য ব্যবস্থাপনা করা হয়।",
    "qA": "কর্পোরেট ডেটাবেজ কী? [চট্টগ্রাম বোর্ড ২০১৯]",
    "qB": "RDBMS-এ ছবি insert করার data type ব্যাখ্যা কর। [সিলেট বোর্ড ২০১৯]",
    "qC": "উদ্দীপকের tableদ্বয়ের relation corporate database-এ কীভাবে কাজে লাগে ব্যাখ্যা কর। [বরিশাল বোর্ড ২০১৯]",
    "qD": "কর্পোরেট database ব্যবহারে সিদ্ধান্ত গ্রহণ কীভাবে দ্রুত হয় তা বিশ্লেষণ কর। [মাদরাসা বোর্ড ২০১৯]"
  },
  {
    "stem": "আফতাব ব্যাংকের ৫০টি শাখায় অনলাইন লেনদেন চালু করা হয়েছে। সব branch database network-এর মাধ্যমে transaction পরিচালনা করে।",
    "qA": "এনটিটি কী? [সমন্বিত বোর্ড ২০১৮]",
    "qB": "ডেটাবেজের কল্যাণে ঘরে বসে বিশ্ববিদ্যালয়ের ভর্তি form পূরণ সম্ভব - ব্যাখ্যা কর। [ঢাকা বোর্ড ২০১৭]",
    "qC": "ব্যাংকের online transaction database কীভাবে কাজ করে তা বিশ্লেষণ কর। [রাজশাহী বোর্ড ২০১৭]",
    "qD": "বড় financial প্রতিষ্ঠানের database নিরাপত্তা ও সেবা উভয় দিক থেকে মূল্যায়ন কর। [দিনাজপুর বোর্ড ২০১৭]"
  },
  {
    "stem": "জামান সাহেব বিদেশে যাওয়ার জন্য e-ticketing সিস্টেমে schedule, seat availability ও payment তথ্য দেখে ticket সংগ্রহ করলেন।",
    "qA": "রেকর্ড কী? [কুমিল্লা বোর্ড ২০১৭]",
    "qB": "সর্টিং ও indexing এক নয় - ব্যাখ্যা কর। [চট্টগ্রাম বোর্ড ২০১৭]",
    "qC": "জামান সাহেব কোন ধরনের database management সুবিধা গ্রহণ করলেন তা বর্ণনা কর। [সিলেট বোর্ড ২০১৭]",
    "qD": "এ ব্যবস্থা সব সেবাদানকারী প্রতিষ্ঠানে চালু হলে digital Bangladesh গঠনে কী ভূমিকা রাখবে তা মূল্যায়ন কর। [বরিশাল বোর্ড ২০১৭]"
  }
];
