export const cqs = [
  {
    stem: "নির্বাচন কমিশন ন্যাশনাল আইডি কার্ড তৈরি করার জন্য প্রাপ্তবয়স্থ নাগরিকদের মুখমণ্ডলের ছবি, আঙুলের ছাপ এবং সিগনেচার সংগ্রহ করে একটি চমৎকার ডাটাবেজ তৈরি করেছে। ইদানীং বাংলাদেশ পাসপোর্ট অফিস নির্বাচন কমিশনের অনুমতি নিয়ে উক্ত ডাটাবেজের নকল পাসপোর্ট তৈরি করার জন্য উক্ত ডাটাবেজ হ্যাক করার চেষ্ট। করে এবং পরিশেষে ব্যর্থ হয়। [চট্টগ্রাম বোর্ড ২০১৭]",
    qC: "নির্বাচন কমিশন ডাটাবেজ তৈরিতে যে প্রযুক্তির সাহায্য নিয়েছিল তা উদ্দীপকের আলোকে বিশ্লেষণ কর।",
    qD: "তথ্য সুরক্ষায় উদ্দীপকের প্রযুক্তির গুরুত্ব বিশ্লেষণ কর।"
  },
  {
    stem: "একটি কলেজের শিক্ষার্থীরা ক্লাসে উপস্থিতির সময় একটি যন্ত্রের উপর আঙুল রেখে উপস্থিতি নিশ্চিত করে। উক্ত কলেজের ICT ল্যাবে প্রবেশের সময় বিশেষ যন্ত্রের দিকে তাকানোর ফলে দরজা খুলে যায়। [দিনাজপুর বোর্ড ২০২৩]",
    qC: "উদ্দীপকের শিক্ষার্থীদের ক্লাসে উপস্থিতির প্রযুক্তি (ফিংগার প্রিন্ট বায়োমেট্রিক্স) বর্ণনা কর।",
    qD: "উদ্দীপকের প্রযুক্তিদ্বয়ের (ফিংগার প্রিন্ট ও রেটিনা/আইরিস স্ক্যান) কোনটি অধিক নির্ভরযোগ্য? তোমার মতামত দাও।"
  },
  {
    stem: "চিপস্ সবার খুবই প্রিয়। চিপস্ প্যাকেটজাতকরণের সময় একটি বিশেষ প্রযুক্তি ব্যবহার করা হয়ে থাকে। চিপস্ কারখানার নিরাপত্তা নিশ্চিতকরণের জন্য প্রবেশের পথে আঙুলের ছাপ দেয়ার জন্য একটি ডিভাইস স্থাপন করা হয়েছে। [কুমিল্লা বোর্ড ২০১৯]",
    qC: "উদ্দীপকে কারখানায় ব্যবহৃত ডিভাইসটির প্রযুক্তিটি (বায়োমেট্রিক্স) ব্যাখ্যা কর।",
    qD: "চিপস্ কারখানার নিরাপত্তায় উক্ত ডিভাইসটির ভূমিকা বিশ্লেষণ কর।"
  },
  {
    stem: "মিসেস পাপিয়ার কপালে একটি টিউমার দেখা দেওয়ায় একটি বিশেষায়িত হাসপাতালে সার্জারির জন্য ভর্তি হলেন। উক্ত হাসপাতালের ডাক্তারগণ আঙুলের ছাপ ব্যবহার করে হাসপাতালে প্রবেশ করেন। সার্জারি বিভাগের ডাক্তার তাকে অপারেশন পূর্ববর্তী বিভিন্ন টেস্ট দিলেন। টেস্টে পাপিয়ার অতিরিক্ত ব্লাড সুগার থাকায় ডাক্তার তাকে ইনসুলিন প্রয়োগে ডায়াবেটিস নিয়ন্ত্রণ করার ব্যবস্থা গ্রহণ করলেন। [দিনাজপুর বোর্ড ২০১৯]",
    qC: "ডাক্তারদের হাসপাতালে প্রবেশের প্রযুক্তি চিহ্নিত করে ব্যাখ্যা কর।",
    qD: "বায়োমেট্রিক্স প্রযুক্তির সুবিধাগুলো উল্লেখপূর্বক হাসপাতালের নিরাপত্তায় এর গুরুত্ব আলোচনা কর।"
  },
  {
    stem: "বাসার সাহেব কম্পিউটার মেলায় গিয়ে একটি হার্ডডিস্ক কিনলেন। হার্ডডিস্কটি আকারে খুব ছোট কিন্তু এর ধারণক্ষমতা অনেক বেশি। তিনি বন্ধু প্রিন্সকে হার্ডডিস্কটি দেখানোর জন্য তাঁর অফিসে গেলেন। প্রিন্সের অফিসে গিয়ে দেখলেন উক্ত অফিসের কর্মকর্তা- কর্মচারীগণ একটি যন্ত্রের দিকে তাকালেই অফিসের দরজা খুলে যাচ্ছে। [চট্টগ্রাম বোর্ড ২০২৪]",
    qC: "হার্ডডিস্ক তৈরিতে ব্যবহৃত প্রযুক্তির বর্ণনা দাও।",
    qD: "প্রিন্সের অফিসের দরজায় ব্যবহৃত প্রযুক্তিটি (আইরিস/রেটিনা স্ক্যান বা ফেইস রিকগনিশন) বিশ্লেষণ কর।"
  },
  {
    stem: "শফিক সাহেব তার গবেষণাগারে দিনাজপুরের ঐতিহ্য ধারণের লক্ষ্যে লিচু নিয়ে গবেষণা করে, তার ফলাফল সংরক্ষণ করেন। তিনি গবেষণাগারের প্রবেশমুখে এমন একটি যন্ত্র বসিয়েছেন যেটির দিকে নির্দিষ্ট সময় তাকালে অনুমোদিত ব্যক্তিবর্গ ভিতরে প্রবেশ করতে পারেন। [চট্টগ্রাম বোর্ড ২০১৯]",
    qC: "গবেষণাগারের প্রবেশমুখে ব্যবহৃত প্রযুক্তিটি ব্যাখ্যা কর।",
    qD: "লিচু নিয়ে গবেষণা ও ফলাফল সংরক্ষণে কোন প্রযুক্তির (বায়োইনফরমেটিক্স) অবদান রয়েছে? বিশ্লেষণ কর।"
  },
  {
    stem: "মি “Y” তার বাবার ল্যাবরেটরিতে প্রবেশের সময় একটি বিশেষ সেন্সরের দিকে তাকানোর ফলে দরজা খুলে গেল। ভিতরে প্রবেশ করে দেখলো প্রথম কক্ষে জৈব তথ্যকে সাজিয়ে গুছিয়ে ইনফরমেশন সিস্টেম তৈরি সংক্রান্ত গবেষণা এবং দ্বিতীয় কক্ষে রিকম্বিনেন্ট ডিএনএ (DNA) তৈরি সংক্রান্ত গবেষণা করা হয়। [রাজশাহী বোর্ড ২০১৭]",
    qC: "ল্যাবরেটরির দরজায় ব্যবহৃত প্রযুক্তিটি বর্ণনা কর।",
    qD: "উদ্দীপকের প্রথম কক্ষের গবেষণা (বায়োইনফরমেটিক্স) এবং দ্বিতীয় কক্ষের গবেষণা (জেনেটিক ইঞ্জিনিয়ারিং) এর মধ্যে সম্পর্ক বিশ্লেষণ কর।"
  },
  {
    stem: "বর্তমান যুগে সৈনিকরা একটি বিশেষ প্রযুক্তি ব্যবহার করে ঘরে বসেই কৃত্রিম পরিবেশে যুদ্ধের বিভিন্ন কৌশল রপ্ত করতে পারেন। প্রশিক্ষণ ক্যাম্পে প্রবেশের জন্য একটি ডিভাইসে আঙুলের ছাপ এবং অপর একটি ডিভাইসের দিকে তাকাতে হয়। [বরিশাল বোর্ড ২০২৪]",
    qC: "সৈনিকদের যুদ্ধের কৌশল রপ্ত করার প্রযুক্তিটি ব্যাখ্যা কর।",
    qD: "উদ্দীপকে প্রশিক্ষণ ক্যাম্পে প্রবেশে ব্যবহৃত প্রযুক্তির পদ্ধতি দুটির তুলনামূলক বিশ্লেষণ কর।"
  },
  {
    stem: "ডা. ইফাদ অত্যধিক শীতল তাপমাত্রা প্রয়োগের মাধ্যমে চিকিৎসা করেন। তার চেম্বারের প্রবেশ পথে প্রথম দরজায় আঙ্গুল এবং দ্বিতীয় দরজায় সম্পূর্ণ হাত একটি মেশিনের উপর রাখতে হয়। [কুমিল্লা বোর্ড ২০২৩]",
    qC: "ডা. ইফাদের চিকিৎসা পদ্ধতিটি ব্যাখ্যা কর।",
    qD: "ডা. সাহেবের চেম্বারে প্রবেশ পথে ব্যবহৃত প্রযুক্তিগুলোর (ফিংগার প্রিন্ট ও হ্যান্ড জিওমেট্রি) মধ্যে কোনটি অধিক জনপ্রিয়? বিশ্লেষণ কর।"
  },
  {
    stem: "ডাঃ 'ক' চিকিৎসায় ক্রয়োজনিত এজেন্ট ব্যবহার করে নিম্ন তাপমাত্রায় চিকিৎসা সেবা দিয়ে থাকেন। তিনি তাঁর ওটিতে প্রবেশের জন্য একটি ডিভাইসে আঙুল স্পর্শ করান। অন্যদিকে গবেষক 'খ' তাঁর কক্ষে প্রবেশ করার জন্য কন্ঠস্বর ব্যবহার করেন। [বরিশাল বোর্ড ২০২৩]",
    qC: "ডাঃ 'ক' এর চিকিৎসা পদ্ধতি বর্ণনা কর।",
    qD: "ডাঃ 'ক' এর এটিতে প্রবেশ করার প্রযুক্তি এবং গবেষক 'খ' তাঁর কক্ষে প্রবেশ করার প্রযুক্তির মধ্যে কোনটি উত্তম? যুক্তি-সহ মতামত দাও।"
  },
  {
    stem: "মিঃ মোকলেছ সাহেব পেশায় মৎস্যবিদ। দেশে মাছের ঘাটতি পূরণের জন্য প্রযুক্তি ব্যবহার করে নতুন নতুন প্রজাতির মাছ উৎপাদন করেন। তার অফিসে প্রবেশের জন্য দরজার সামনে রাখা একটি মেশিনে আঙুলের ছাপ দিলে দরজা খুলে যায়। অতঃপর তার কক্ষে প্রবেশের জন্য দরজার সামনে রাখা একটি মেশিনের দিকে তাকালে দরজা খুলে যায়। [ঢাকা বোর্ড ২০১৯]",
    qC: "মিঃ মোকলেছ সাহেব নতুন প্রজাতির মাছ উৎপাদনে কোন প্রযুক্তি ব্যবহার করেন? ব্যাখ্যা কর।",
    qD: "উদ্দীপকের আলোকে অফিসে প্রবেশ ও কক্ষে প্রবেশের জন্য কৌশল দুটির মধ্যে কোনটি বেশি সুবিধাজনক? বিশ্লেষণ কর।"
  },
  {
    stem: "“S” সাহেব একজন বড় ব্যবসায়ী। তার অফিসের কর্মচারীদেরকে একটি সুইচে হাতের ছাপ দিয়ে উপস্থিতি নিশ্চিত করতে হয় এবং কারখানায় প্রবেশ করার জন্য শ্রমিকরা মনিটরের দিকে তাকানোর পর দরজা খুলে যায়। “S” সাহেব এর কপালে টিউমার অপারেশন করতে গেলে ডা. সাহেব কোনো রক্তপাত ছাড়াই একটি বিশেষ পদ্ধতিতে অত্যন্ত নিম্ন তাপমাত্রায় টিউমার অপারেশন করে দেন। [সমন্বিত বোর্ড ২০১৮]",
    qC: "ডা. সাহেবের টিউমার অপারেশনের প্রযুক্তিটি ব্যাখ্যা কর।",
    qD: "উদ্দীপকের “S” সাহেবের অফিসের উপস্থিতি নিশ্চিত ও কারখানায় প্রবেশের প্রক্রিয়াদ্বয়ের মধ্যে কোনটি বহুল ব্যবহৃত? বিশ্লেষণ কর।"
  }
];
