import { PracticeMCQ } from "../../../ict-syllabus";

export const practiceMCQs: PracticeMCQ[] = [
    {
      q: "কোন প্রজন্মের ভাষাকে অ্যাসেম্বলি ভাষা বলা হয়?",
      options: ["প্রথম", "দ্বিতীয়", "তৃতীয়", "চতুর্থ"],
      correct: "দ্বিতীয়",
      explanation:
        "দ্বিতীয় প্রজন্মের ভাষাকে অ্যাসেম্বলি ভাষা বা সাংকেতিক ভাষা বলা হয়।",
    },
    {
      q: "মানুষের ভাষার সাথে কোন ভাষার মিল সবচেয়ে বেশি?",
      options: [
        "মেশিন ভাষা",
        "অ্যাসেম্বলি ভাষা",
        "উচ্চ স্তরের ভাষা",
        "কোনোটিই নয়",
      ],
      correct: "উচ্চ স্তরের ভাষা",
      explanation:
        "উচ্চ স্তরের ভাষা (যেমন C, Python) ইংরেজি ভাষার মতো, যা মানুষের জন্য বোঝা সহজ।",
    },
  ];
