export const cqs = [
  {
    stem: "রাহবার উচ্চ মাধ্যমিক পাস করে বিশ্ববিদ্যালয়ে ভর্তি হলো। সে তার এক বিদেশি বন্ধুর কাছ থেকে জানতে পারল যে, সেদেশে কিছু গাড়ি রয়েছে যেগুলো চলাচলে চালকের প্রয়োজন হয় না এবং স্বয়ংক্রিয়ভাবে রাস্তায় চলাচলে সক্ষম। রাহবার তার বিশ্ববিদ্যালয়ে প্রবেশের সময় আঙুলের ছাপ দিয়ে ক্যাম্পাসের ভিতরে প্রবেশ করে দেখল যে, ক্যাম্পাসের একটি নির্দিষ্ট কক্ষে একদল শিক্ষার্থী ক্যান্সারের উপর গবেষণা করছে। [সিলেট বোর্ড ২০২৩]",
    qC: "উদ্দীপকে উল্লিখিত গাড়ি চলাচলে ব্যবহৃত প্রযুক্তি (কৃত্রিম বুদ্ধিমত্তা ও রোবটিকস) ব্যাখ্যা কর।",
    qD: ""
  },
  {
    stem: "মি. এক্স গবেষণা করার উদ্দেশ্যে 'ক' দেশে পৌছে বিমান থেকে নেমে ড্রাইভারবিহীন স্বয়ংক্রিয় গাড়ি চড়ে গন্তব্যস্থলে পৌছান। সেখানে তাঁকে এমন একটি বাড়িতে থাকতে দেয়া হয়, যার সব কিছুই আধুনিক তথ্য প্রযুক্তি দ্বারা নিয়ন্ত্রিত। [বরিশাল বোর্ড ২০২৩]",
    qC: "উদ্দীপকে উল্লিখিত গাড়িটি তৈরি করার প্রযুক্তি (কৃত্রিম বুদ্ধিমত্তা ও রোবটিকস) আলোচনা কর।",
    qD: ""
  },
  {
    stem: "বাংলাদেশের রাজধানীর অদূরে তথ্য প্রযুক্তি প্রয়োগে একটি বিশ্বমানের শিল্প কারখানা স্থাপন করার পরিকল্পনা করা হয়েছে, যেখানে অ্যাকচুয়েটর এর সাহায্যে দক্ষ হাতে কম্পিউটারের প্রয়োজনীয় যন্ত্রপাতি তৈরি করার মাধ্যমে দেশকে উন্নত ও অর্থনৈতিকভাবে স্বাবলম্বী হতে সহায়তা করবে। উক্ত প্রতিষ্ঠানের দক্ষ প্রোগ্রামারগণ বসে দর্শনার্থীদের শহরের সিমুলেটেড পরিবেশ স্থাপন করে ঘরে বসে বিভিন্ন দর্শনীয় স্থান দেখার ব্যবস্থা করবেন। [রাজশাহী বোর্ড ২০১৯]",
    qC: "শিল্প কারখানায় ব্যবহৃত প্রযুক্তি (রোবটিকস) চিহ্নিত করে ব্যাখ্যা কর।",
    qD: ""
  },
  {
    stem: "বাংলাদেশের পোশাক তৈরির একটি প্রতিষ্ঠান চতুর্থ শিল্প বিপ্লবের সাথে তাল মিলিয়ে চলতে বিশ্বমানের একটি কারখানা স্থাপন করার পরিকল্পনা গ্রহণ করেছে, যেখানে মানুষের সহায়তা ছাড়াই অ্যাকচুয়েটর এবং কম্পিউটারের সাহায্যে পোশাক তৈরির অধিকাংশ কাজ করা সম্ভব হবে। কারখানাটি স্থাপনের উদ্দেশ্যে প্রকৌশলীগণ কৃত্রিম সিমুলেটেড পরিবেশ তৈরি করে কারখানাটির ত্রি-মাত্রিক মডেল প্রণয়ন করেন। [ঢাকা বোর্ড ২০২৪]",
    qC: "",
    qD: "উদ্দীপকে উল্লিখিত পোষাক শিল্পে বর্ণিত প্রযুক্তিটি (রোবটিকস) শ্রম বাজারের উপর কীরূপ প্রভাব ফেলবে?"
  },
  {
    stem: "'ক' গার্মেন্টস ফ্যাক্টরিতে অগ্নিসংযোগে নিহত শ্রমিকের পরিচয় শনাক্ত করতে DNA পরীক্ষা করা হয়। রাকিব এই ধরনের অগ্নিকাণ্ডের কথা মাথায় রেখে এমন এক যন্ত্র আবিষ্কার করেছে যা একই সময়ে অগ্নি নির্বাপণে ও উদ্ধারকার্যে সহায়তা করবে। [রা.বো.- ২০২৪]",
    qC: "",
    qD: "উদ্দীপকে রাকিবের আবিষ্কৃত যন্ত্রটিকে (রোবট) আমাদের দৈনন্দিন কাজে ব্যবহার সম্ভব- বিশ্লেষণপূর্বক মতামত দাও।"
  }
];
