import { PracticeMCQ } from "../../../ict-syllabus";

export const practiceMCQs: PracticeMCQ[] = [
    {
      q: "কোন অনুবাদক প্রোগ্রাম লাইন বাই লাইন অনুবাদ করে?",
      options: ["কম্পাইলার", "ইন্টারপ্রেটার", "অ্যাসেম্বলার", "লিংকার"],
      correct: "ইন্টারপ্রেটার",
      explanation:
        "ইন্টারপ্রেটার সোর্স কোডের এক লাইন পড়ে এবং তা অনুবাদ করে এক্সিকিউট করে।",
    },
    {
      q: "অ্যাসেম্বলি ভাষাকে মেশিন ভাষায় রূপান্তর করে কোনটি?",
      options: ["কম্পাইলার", "ইন্টারপ্রেটার", "অ্যাসেম্বলার", "ডিবাগার"],
      correct: "অ্যাসেম্বলার",
      explanation:
        "অ্যাসেম্বলার হলো এমন একটি অনুবাদক প্রোগ্রাম যা অ্যাসেম্বলি ভাষার নেমোনিক কোডকে মেশিন ভাষায় রূপান্তর করে।",
    },
  ];
