export const practiceMcqs = [
  {
    q: "১ ন্যানো সমান-",
    options: ["একশত কোটি ভাগের এক ভাগ", "এক কোটি ভাগের এক ভাগ", "দশ কোটি ভাগের এক ভাগ", "এক হাজার কোটি ভাগের এক ভাগ"],
    correct: "একশত কোটি ভাগের এক ভাগ",
    explanation: "১ মিটারের ১০০ কোটি ভাগের এক ভাগকে বলা হয় ১ ন্যানো মিটার।"
  },
  {
    q: "এক ন্যানোমিটার সমান কত মিটার? [ব. বো. ২০১৭, য. বো. ২০১৬, কু. বো. ২০১৬]",
    options: ["10^-6 মিটার", "10^-7 মিটার", "10^-8 মিটার", "10^-9 মিটার"],
    correct: "10^-9 মিটার",
    explanation: "1 nm = 10^-9 m"
  },
  {
    q: "আণবিক পর্যায়ে পদার্থকে পরিবর্তন ও নিয়ন্ত্রণ করার প্রযুক্তিকে বলা হয়- [সকল. বো. ২০১৮]",
    options: ["জেনেটিক ইঞ্জিনিয়ারিং", "নিউক্লিয়ার ইঞ্জিনিয়ারিং", "বায়োইনফরমেটিক্স", "ন্যানোটেকনোলজি"],
    correct: "ন্যানোটেকনোলজি",
    explanation: "আণবিক বা পারমাণবিক পর্যায়ে পদার্থের পরিবর্তন ও নিয়ন্ত্রণ করার বিদ্যা হলো ন্যানোটেকনোলজি।"
  },
  {
    q: "ন্যানো প্রযুক্তির জনক বলা হয় কাকে?",
    options: ["জোহান্স মেন্ডেস", "লুই পাস্তুর", "রিচার্ড ফাইনম্যান", "মার্শাল মাকলুহান"],
    correct: "রিচার্ড ফাইনম্যান",
    explanation: "১৯৫৯ সালে আমেরিকান বিখ্যাত পদার্থবিদ রিচার্ড ফাইনম্যান প্রথম ন্যানো টেকনোলজির ধারণা বর্ণনা করেছিলেন।"
  },
  {
    q: "যেসব বস্তু নিয়ে ন্যানো প্রযুক্তিতে কাজ করা হয় তাদের মাত্রা কত ন্যানোমিটারের কম?",
    options: ["১", "১০", "১০০", "১০০০"],
    correct: "১০০",
    explanation: "সাধারণত ১ থেকে ১০০ ন্যানোমিটার স্কেলে ন্যানোটেকনোলজি পরিচালিত হয়।"
  },
  {
    q: "স্মার্ট ওষুধ তৈরিতে ব্যবহৃত প্রযুক্তি কোনটি? [য. বো. '২৪]",
    options: ["ন্যানোটেকনোলজি", "বায়োমেট্রিক্স", "জেনেটিক ইঞ্জিনিয়ারিং", "আর্টিফিসিয়াল ইনটেলিজেন্স"],
    correct: "ন্যানোটেকনোলজি",
    explanation: "ন্যানোটেকনোলজির সাহায্যে স্মার্ট ড্রাগ তৈরি করে রোগাক্রান্ত কোষে সরাসরি ঔষধ প্রয়োগ করা সম্ভব হচ্ছে।"
  },
  {
    q: "ট্যানারি শিল্পের বর্জ্যকে দূষণমুক্ত করতে কোন প্রযুক্তি ব্যবহৃত হয়? [দি. বো. '২৪]",
    options: ["Virtual reality", "Nano technology", "Bioinformatics", "Genetic engineering"],
    correct: "Nano technology",
    explanation: "শিল্পকারখানা হতে নির্গত ক্ষতিকর রাসায়নিক বর্জ্যকে ন্যানো পার্টিকেল ব্যবহার করে অক্ষতিকর বস্তুতে রূপান্তর করা যায়।"
  },
  {
    q: "টপ ডাউন পদ্ধতিতে কোন জিনিসকে নির্দিষ্ট আকার দেওয়া হয়। এর সাথে সংশ্লিষ্ট প্রযুক্তি কোনটি? [চ. বো. '১৯]",
    options: ["বায়োমেট্রিক্স", "বায়োইনফরমেটিক্স", "ন্যানোটেকনোলজি", "জেনেটিক ইঞ্জিনিয়ারিং"],
    correct: "ন্যানোটেকনোলজি",
    explanation: "Top-down হলো ন্যানোটেকনোলজির একটি পদ্ধতি যেখানে বড় আকৃতির বস্তুকে কেটে ক্ষুদ্রাকৃতি দেয়া হয়।"
  },
  {
    q: "ন্যানোপার্টিকেলের আকৃতি কত? [ঢা. বো. '২৩]",
    options: ["1 থেকে 100 nm", "1 থেকে 200 nm", "1 থেকে 300 nm", "1 থেকে 400 nm"],
    correct: "1 থেকে 100 nm",
    explanation: "ন্যানোপার্টিকেলের সাধারণ আকৃতি ১ থেকে ১০০ ন্যানোমিটারের মধ্যে হয়।"
  },
  {
    q: "ন্যানো প্রযুক্তি কয়টি পদ্ধতিতে ব্যবহৃত হয়? [চ. বো. '২৩]",
    options: ["২টি", "৩টি", "৪টি", "৫টি"],
    correct: "২টি",
    explanation: "ন্যানোটেকনোলজিতে প্রধানত দুটি পদ্ধতি ব্যবহৃত হয়: ১) bottom-up এবং ২) top-down।"
  }
];
