export const cqs = [
  {
    stem: "আইসিটি পরীক্ষায় আনিকা ও মাইশা যথাক্রমে (3A)₁₆ এবং (72)₈ নম্বর পেল। শিক্ষক বললেন, তোমাদের দুজনের নম্বরের পার্থক্য ২-এর পরিপূরক পদ্ধতিতে বের করা সম্ভব।",
    qC: "মাইশার প্রাপ্ত নম্বরকে বাইনারিতে রূপান্তর কর।",
    qD: "শিক্ষকের উক্তি অনুযায়ী ২-এর পরিপূরক পদ্ধতিতে আনিকা ও মাইশার নম্বরের পার্থক্য নির্ণয় কর।"
  },
  {
    stem: "রাকিবের ব্যাংকে জমার পরিমাণ (55)₁₀ টাকা। সে ব্যাংক থেকে কিছু টাকা তোলার পর তার ব্যালেন্স হলো (-15)₁₀ টাকা।",
    qC: "রাকিবের বর্তমান ব্যালেন্স (-15)₁₀ কে 8-বিট রেজিস্টারের জন্য ২-এর পরিপূরক পদ্ধতিতে প্রকাশ কর।",
    qD: "রাকিব ব্যাংক থেকে মোট কত টাকা তুলেছিল তা ২-এর পরিপূরক পদ্ধতি ব্যবহার করে নির্ণয় কর।"
  }
];
