import { CQ } from "../../../ict-syllabus";

export const cqs: CQ[] = [
  {
    "stem": "ID, Salary, J-date, Photo ফিল্ড নিয়ে একটি কর্মচারী টেবিল তৈরি করা হবে।",
    "qA": "ডেটাবেজ কী? [চট্টগ্রাম বোর্ড ২০১৬]",
    "qB": "ডেটাবেজ কেন indexing করা হয়? [সিলেট বোর্ড ২০১৬]",
    "qC": "টেবিলটির Salary, J-date ও Photo কলামের ডেটা টাইপ বর্ণনা দাও। [যশোর বোর্ড ২০১৬]",
    "qD": "উদ্দীপকের টেবিলটি তৈরির জন্য SQL কমান্ড লিখ। [মাদরাসা বোর্ড ২০১৬]"
  },
  {
    "stem": "Admission টেবিলে Roll No, Name, GPA, Date, Fee এবং Phone টেবিলে Roll No, Phone Number রাখা হয়েছে।",
    "qA": "সাইফার টেক্সট কী? [ঢাকা বোর্ড ২০১৯]",
    "qB": "প্রাইমারি কী ও ফরেন কী এক নয় - ব্যাখ্যা কর। [রাজশাহী বোর্ড ২০১৯]",
    "qC": "Admission টেবিলের ফিল্ডগুলোর data type ব্যাখ্যা কর। [দিনাজপুর বোর্ড ২০১৯]",
    "qD": "দুটি টেবিলের মধ্যে relation তৈরি করা সম্ভব কি না বিশ্লেষণ কর। [কুমিল্লা বোর্ড ২০১৯]"
  },
  {
    "stem": "Student Table-এ Name, Roll, Class, Address ফিল্ডে Shila, Sima, Rony ও Moni-এর তথ্য রাখা হয়েছে।",
    "qA": "জাংশন টেবিল কী? [চট্টগ্রাম বোর্ড ২০১৯]",
    "qB": "Lookup Wizard টাইপে ডেটা সুনির্দিষ্ট হতে হয় কেন? [সিলেট বোর্ড ২০১৯]",
    "qC": "Student Table-এর ফিল্ডগুলোর data type ব্যাখ্যা কর। [বরিশাল বোর্ড ২০১৯]",
    "qD": "Student Table-এ কী ফিল্ড ব্যবহৃত হবে তা বিশ্লেষণ কর। [মাদরাসা বোর্ড ২০১৯]"
  },
  {
    "stem": "Roll, Name, Date of Birth, Remarks ফিল্ডসহ একটি টেবিলে Rima, Sima, Apu ও Jahid-এর তথ্য রাখা হয়েছে।",
    "qA": "রাউটার কী? [সমন্বিত বোর্ড ২০১৮]",
    "qB": "ক্যারেক্টার বাই ক্যারেক্টার ডেটা ট্রান্সমিট পদ্ধতি ব্যাখ্যা কর। [ঢাকা বোর্ড ২০১৭]",
    "qC": "উদ্দীপকের টেবিল তৈরির পদক্ষেপ ব্যাখ্যা কর। [রাজশাহী বোর্ড ২০১৭]",
    "qD": "উদ্দীপকের আলোকে ডেটা সংরক্ষণ করলে সুবিধা ও অসুবিধা কী হতে পারে তা মূল্যায়ন কর। [দিনাজপুর বোর্ড ২০১৭]"
  }
];
