import { PracticeMCQ } from "../../../ict-syllabus";

export const practiceMCQs: PracticeMCQ[] = [
    {
      q: "কোন কি-এর মান কখনো ডুপ্লিকেট হতে পারে না?",
      options: ["ফরেন কি", "প্রাইমারি কি", "ক্যান্ডিডেট কি", "সুপার কি"],
      correct: "প্রাইমারি কি",
      explanation:
        "প্রাইমারি কি-এর প্রধান শর্ত হলো এর মান অদ্বিতীয় (Unique) হতে হবে এবং ফাঁকা (Null) থাকা যাবে না।",
    },
    {
      q: "দুটি টেবিলের মধ্যে সম্পর্ক স্থাপনে কোনটি ব্যবহৃত হয়?",
      options: ["প্রাইমারি কি", "ফরেন কি", "কম্পোজিট কি", "ক্যান্ডিডেট কি"],
      correct: "ফরেন কি",
      explanation:
        "একটি টেবিলের প্রাইমারি কি অন্য টেবিলে ফরেন কি হিসেবে কাজ করে এবং টেবিল দুটির মধ্যে রিলেশন তৈরি করে।",
    },
  ];
