import { CQ } from "../../../ict-syllabus";

export const cqs: CQ[] = [
  {
    "stem": "Customer টেবিলে Customer ID, Zilla, Date of Birth এবং Rent টেবিলে Customer ID, Room No, Rent TK আছে।",
    "qA": "RDBMS কী? [ঢাকা বোর্ড ২০১৯]",
    "qB": "ডেটাবেজ relation তৈরির দুটি শর্ত লিখ। [রাজশাহী বোর্ড ২০১৯]",
    "qC": "Rent টেবিলে Date নামে নতুন field সংযোজনের প্রক্রিয়া ব্যাখ্যা কর। [দিনাজপুর বোর্ড ২০১৯]",
    "qD": "Customer টেবিলের Date of Birth field ঊর্ধ্বক্রমে সাজিয়ে table তৈরি করে প্রদর্শন কর। [কুমিল্লা বোর্ড ২০১৯]"
  },
  {
    "stem": "কোম্পানির Product টেবিলে Prod-id, Product Name, Unit Price এবং Sale টেবিলে Emp-id, Sale Amount, Prod-id আছে। মালিক Product টেবিলের ১ম field ভিত্তিতে data এমনভাবে সাজালেন যাতে নতুন পণ্য যোগ করলেও পুনরায় সাজাতে না হয়।",
    "qA": "কর্পোরেট ডেটাবেজ কী? [চট্টগ্রাম বোর্ড ২০১৯]",
    "qB": "RDBMS-এ ছবি insert করতে কোন data type ব্যবহৃত হয়? [সিলেট বোর্ড ২০১৯]",
    "qC": "উদ্দীপকের টেবিলদ্বয়ের relation ব্যাখ্যা কর। [বরিশাল বোর্ড ২০১৯]",
    "qD": "মালিকের ব্যবহৃত record সাজানোর পদ্ধতির সুবিধা বিশ্লেষণ কর। [মাদরাসা বোর্ড ২০১৯]"
  },
  {
    "stem": "এক ব্যক্তি salary ৪০,০০০ বা তার বেশি এমন কর্মচারীদের নাম ও designation query দিয়ে বের করলেন; অন্য ব্যক্তি বললেন একটি গুরুত্বপূর্ণ file তৈরি করলে কাজ দ্রুত হবে কিন্তু data entry-তে সময় বেশি লাগবে।",
    "qA": "RDBMS কী? [সমন্বিত বোর্ড ২০১৮]",
    "qB": "SQL-কে database-এর হাতিয়ার বলা হয় কেন? [ঢাকা বোর্ড ২০১৭]",
    "qC": "প্রয়োজনীয় column যুক্ত করে relation তৈরি কর। [রাজশাহী বোর্ড ২০১৭]",
    "qD": "গ ব্যক্তির index file সংক্রান্ত মতামতের সাথে তুমি একমত কি না বিশ্লেষণ কর। [দিনাজপুর বোর্ড ২০১৭]"
  },
  {
    "stem": "জামান সাহেব ই-টিকিটিং ব্যবস্থায় schedule অনুযায়ী আসন বিন্যাস ও বিমানের তথ্য দেখে online payment করে ticket সংগ্রহ করলেন।",
    "qA": "রেকর্ড কী? [কুমিল্লা বোর্ড ২০১৭]",
    "qB": "সর্টিং ও ইনডেক্সিং এক নয় - ব্যাখ্যা কর। [চট্টগ্রাম বোর্ড ২০১৭]",
    "qC": "জামান সাহেব কোন ধরনের database management সুবিধা গ্রহণ করলেন তা বর্ণনা কর। [সিলেট বোর্ড ২০১৭]",
    "qD": "এ ধরনের ব্যবস্থা সব সেবাদানকারী প্রতিষ্ঠানে চালু হলে digital সেবা কতটা উন্নত হবে তা মূল্যায়ন কর। [বরিশাল বোর্ড ২০১৭]"
  }
];
