export const cqs = [
  {
    stem: "“X” কলেজে মানবিক, ব্যবসায় শিক্ষা ও বিজ্ঞান বিভাগের তিনটি আলাদা ভবন আছে। প্রতিটি বিভাগে তাদের কম্পিউটারের মধ্যে নিজস্ব নেটওয়ার্ক ব্যবস্থা রয়েছে। কলেজের অধ্যক্ষ প্রতিটি বিভাগকে নেটওয়ার্কের আওতায় আনার সিদ্ধান্ত নিলেন। কিন্তু বিভাগগুলোর দূরত্ব বেশি হওয়ায় মাধ্যম হিসাবে ক্যাবল ব্যবহার সম্ভব হচ্ছে না।",
    qC: "উদ্দীপকে মানবিক বিভাগের নেটওয়ার্কের ধরন সম্পর্কে বর্ণনা দাও।",
    qD: "অধ্যক্ষের সিদ্ধান্ত বাস্তবায়নের জন্য তারবিহীন মাধ্যম হিসেবে কোন প্রযুক্তি নির্বাচন করা যেতে পারে? বিশ্লেষণ কর।"
  },
  {
    stem: "সেতু একটি কেন্দ্রীয় কানেকটিং ডিভাইস দিয়ে তাদের বাসার চারটি ডিজিটাল ডিভাইসের মধ্যে নেটওয়ার্ক স্থাপন করার চিন্তা করল। কেন্দ্রীয় ডিভাইস ব্যবহার করতে চাইল কারণ কোনো একটি ডিজিটাল ডিভাইস নষ্ট হলে যেন পুরো নেটওয়ার্ক সিস্টেম অচল না হয়। কিন্তু তার ভাই শুধুমাত্র নেটওয়ার্কের ব্যাকবোন ক্যাবলের সাহায্যে নেটওয়ার্ক স্থাপন করতে চাইল যাতে নেটওয়ার্ক বাস্তবায়ন খরচ কম হয়।",
    qC: "ভৌগোলিক বিস্তৃতির বিচারে উদ্দীপকে গঠিত নেটওয়ার্কটি ব্যাখ্যা কর।",
    qD: "সেতু এবং তার ভাইয়ের প্রস্তাবিত নেটওয়ার্ক কাঠামোর (টপোলজি) তুলনামূলক বিশ্লেষণ কর।"
  },
  {
    stem: "‘X’ কলেজ ঢাকা শহরের একটি স্বনামধন্য শিক্ষা প্রতিষ্ঠান। দেশের বিভিন্ন জেলায় তাদের আরও পাঁচটি শাখা আছে। অধ্যক্ষ সাহেব মূল প্রতিষ্ঠানে বসেই সবগুলো শাখা সুষ্ঠুভাবে পরিচালনার জন্য একটি নেটওয়ার্ক ব্যবস্থা গড়ে তুলেছেন।",
    qC: "উদ্দীপকের আলোকে মূল শিক্ষা প্রতিষ্ঠান ও তার শাখাগুলোকে পরিচালনার জন্য কোন ধরনের নেটওয়ার্ক স্থাপন করা হয়েছিল? তার বর্ণনা দাও।",
    qD: "পরবর্তীতে শিক্ষক এবং শিক্ষার্থীদের অনুরোধে ইন্টারনেট ব্যবহার করে যে পরিসেবার (ক্লাউড কম্পিউটিং) কথা ভাবছিলেন তার যৌক্তিকতা বিশ্লেষণ কর।"
  },
  {
    stem: "মি. রফিক একজন উদ্যোক্তা। তিনি খুলনা অঞ্চলের কৃষকদের ঋণ দিয়ে সহযোগিতার উদ্দেশ্যে একটি ব্যাংক প্রতিষ্ঠা করেন। খুলনা শহরে ব্যাংকটির ৫টি শাখা রয়েছে যা নেটওয়ার্কের মাধ্যমে সংযুক্ত। সকল ব্রাঞ্চের ডেটার ব্যাকআপ ইন্টারনেট ভিত্তিক সেবা গ্রহণের মাধ্যমে সংরক্ষিত রাখা হয়।",
    qC: "উদ্দীপকের ৫টি শাখার মধ্যে স্থাপিত নেটওয়ার্কটি ভৌগোলিক দূরত্বের ভিত্তিতে কোন ধরনের? ব্যাখ্যা কর।",
    qD: "সকল ব্রাঞ্চের ডেটা ব্যাকআপ রাখার জন্য ইন্টারনেট ভিত্তিক যে প্রযুক্তি ব্যবহৃত হয়েছে তার সুবিধাগুলো বিশ্লেষণ কর।"
  }
];
