export const cqs = [
  {
    stem: "আইসিটি নির্ভর জ্ঞান ও প্রযুক্তি মানুষকে সমৃদ্ধির পথে এগিয়ে নিচ্ছে। আরিফ আইসিটি বিষয়ে পড়াশুনা করে এমন একটি যোগাযোগ মাধ্যম সম্পর্কে জানতে পারল যেখানে শব্দের পাশাপাশি চলমান ছবিও পাঠানো যায়। তবে এ মাধ্যমে ডেটা বাঁকা পথে চলাচল করতে পারে না বিধায় উঁচু ভবনের উপর টাওয়ার বসানোর প্রয়োজন হয় যার ফ্রিকোয়েন্সি 300MHz-300GHz। পরবর্তীতে নতুন উদ্ভাবিত একটি প্রযুক্তির সাথে এর সম্মিলন ঘটানো হয়, যা সমুদ্রের তলদেশ দিয়ে এক মহাদেশকে অন্য মহাদেশের সাথে যুক্ত করেছে।",
    qC: "উদ্দীপকের প্রথম মাধ্যমটি ব্যাখ্যা কর।",
    qD: "‘দ্বিতীয় মাধ্যমটি প্রথম মাধ্যম অপেক্ষাকৃত সুবিধাজনক’- যুক্তিসহ মূল্যায়ন কর।"
  },
  {
    stem: "নুসাইবা তার ফ্ল্যাটের তিনটি রুমের তিনটি কম্পিউটারকে নেটওয়ার্কে স্থাপন করতে চাইল যাতে তার বাবার রুমে কম্পিউটারের সাথে যুক্ত প্রিন্টারটি পরিবারের সবাই ব্যবহার করতে পারে। নেটওয়ার্ক স্থাপনে তার বাবার পরামর্শ হলো কোনো না কোনো তার (ক্যাবল) মাধ্যম ব্যবহার করা এবং তার আম্মার পরামর্শ হলো কোনো না কোনো ওয়্যারলেস মিডিয়া ব্যবহার করা। তবে নুসাইবা মাঝে মাঝে নিজের মোবাইল ফোন এবং তার আম্মার মোবাইল ফোনের সাথে IEEE 802.15 স্ট্যান্ডার্ড-এর একটি প্রযুক্তির সাহায্যে তথ্য আদান-প্রদান করে।",
    qC: "নুসাইবা উদ্দীপকে যে প্রযুক্তির সাহায্যে তথ্য আদান-প্রদান করে তার মাধ্যমটি ব্যাখ্যা কর।",
    qD: "উদ্দীপকে নেটওয়ার্ক স্থাপনে নুসাইবার কার পরামর্শ গ্রহণ করা উচিত বলে তুমি মনে কর? উত্তরের পক্ষে যুক্তি দাও।"
  }
];
