export const cqs = [
  {
    stem: "একটি কলেজের সুযোগ্য অধ্যক্ষ মহোদয় ২৫টি নতুন কম্পিউটার দিয়ে ICT ল্যাব স্থাপনের ব্যবস্থা করলেন। ল্যাবটির নেটওয়ার্ক স্থাপনের জন্য আইসিটি শিক্ষক এমন একটি টপোলজির প্রস্তাব দিলেন যেখানে একটি কেন্দ্রীয় হাব ব্যবহৃত হবে। কিন্তু ল্যাব অ্যাসিস্ট্যান্ট বললেন, 'স্যার, হাবের পরিবর্তে সুইচ ব্যবহার করলে ডেটার সংঘর্ষ হবে না এবং গতি বাড়বে।' অন্যদিকে অধ্যক্ষ সাহেব চাচ্ছেন এমন টপোলজি যেখানে প্রতিটি কম্পিউটার একে অপরের সাথে সরাসরি যুক্ত থাকবে।",
    qC: "আইসিটি শিক্ষকের প্রস্তাবিত টপোলজিটি চিত্রসহ ব্যাখ্যা কর।",
    qD: "অধ্যক্ষ সাহেবের প্রস্তাবিত টপোলজি এবং আইসিটি শিক্ষকের প্রস্তাবিত টপোলজির মধ্যে কোনটি ল্যাবের জন্য অধিক সাশ্রয়ী ও বাস্তবসম্মত? বিশ্লেষণপূর্বক মতামত দাও।"
  },
  {
    stem: "মি. আরিফ তার অফিসের কম্পিউটার ও অন্যান্য ইলেকট্রনিক ডিভাইসগুলো একটি নেটওয়ার্কের সাহায্যে সংযুক্ত করার পরিকল্পনা করলেন। এতে নেটওয়ার্ক ব্যাকবোন হিসাবে তিনি এক ধরনের ক্যাবল ব্যবহার করেন যেখানে সকল কম্পিউটার যুক্ত থাকে। কিন্তু কিছুদিন পর দেখা গেল মূল ক্যাবলে সমস্যা হওয়ায় পুরো অফিসের কাজ বন্ধ হয়ে গেছে। তখন তিনি এমন এক টপোলজির চিন্তা করলেন যা একাধিক শাখা-প্রশাখার মাধ্যমে কাজ করবে।",
    qC: "উদ্দীপকে মি. আরিফের প্রাথমিকভাবে গঠিত নেটওয়ার্ক টপোলজিটি ব্যাখ্যা কর।",
    qD: "অফিসের কাজের পরিধি বাড়াতে মি. আরিফের নতুন চিন্তা করা টপোলজিটির যৌক্তিকতা বিশ্লেষণ কর।"
  },
  {
    stem: "কুশিয়ারা কলেজে বিভিন্ন বিভাগের কম্পিউটারগুলো এমনভাবে যুক্ত রয়েছে যেন প্রথম হতে শেষ পর্যন্ত কম্পিউটারগুলো পরস্পর চক্রাকারে যুক্ত। কিন্তু এই ব্যবস্থায় একটি কম্পিউটার নষ্ট হলে পুরো নেটওয়ার্ক অচল হয়ে পড়ে। সময় বাঁচানোর জন্য এবং সমস্যা এড়ানোর জন্য আইসিটি শিক্ষক এমন টপোলজির পরিবর্তন করলেন যেখানে প্রতিটি ডিভাইসের জন্য একটি করে ডেডিকেটেড ক্যাবল দিয়ে কেন্দ্রীয় সুইচের সাথে যুক্ত করা হয়।",
    qC: "কলেজটিতে পূর্বে কোন ধরনের টপোলজি ব্যবহৃত হয়েছিল? তার বৈশিষ্ট্য লেখ।",
    qD: "আইসিটি শিক্ষকের নতুন টপোলজি ব্যবহারের যৌক্তিকতা মূল্যায়ন কর।"
  }
];
