export const cqs = [
  {
    stem: "মোকাররম সাহেব মেট্রোপলিটন এরিয়ার বিভিন্ন অফিসে ক্যাবল মাধ্যমে নিজস্ব নেটওয়ার্ক তৈরি করেন এবং তিনি তার হেড অফিস হতে শাখা অফিস নিয়ন্ত্রণ করেন। এতে তার ডেটা স্থানান্তর খুব ধীর গতিতে হয়ে থাকে। যার ডেটা ট্রান্সমিশন স্পিড ৩০০bps। কিন্তু তিনি জানতে পারলেন বাংলাদেশে রেলওয়ে সারা দেশের সকল রেলস্টেশনে পরিবেশ বান্ধব বিশেষ তারের মধ্য দিয়ে অতি দ্রুত ডেটা আদান প্রদান হয়ে থাকে। মোকাররম সাহেব তার নেটওয়ার্ক ক্যাবল পরিবর্তন করে রেলওয়ের মতো করার চিন্তা করেন।",
    qC: "উদ্দীপকে মোকাররম সাহেবের ডেটা স্থানান্তরে ধীরগতির সমস্যার কারণ চিহ্নিতপূর্বক ব্যাখ্যা কর। (ন্যারো ব্যান্ডের ব্যবহার)",
    qD: "উদ্দীপকে মোকাররম সাহেবের সিদ্ধান্ত (ব্রডব্যান্ড ফাইবার অপটিক ক্যাবল ব্যবহার) কতটুকু ফলপ্রসূ হবে বলে তুমি মনে কর? যুক্তিসহ বিশ্লেষণ কর।"
  },
  {
    stem: "ডেটা কমিউনিকেশনের মৌলিক উপাদান: ১. উৎস (Source) -> ২. প্রেরক (Transmitter) -> ৩. মাধ্যম (Medium) -> ৪. প্রাপক (Receiver) -> ৫. গন্তব্য (Destination)",
    qC: "ডেটা কমিউনিকেশনের মৌলিক উপাদানের প্রবাহ চিত্রটির ব্যাখ্যা কর।",
    qD: "ডেটা ট্রান্সমিশনে (২) প্রেরক ও (৪) প্রাপক এর ভূমিকা বিশ্লেষণ কর।"
  },
  {
    stem: "মি. সাজিদ “বিডিরেন” নামক একটি প্রতিষ্ঠান থেকে ইন্টারনেট সংযোগ নিয়েছে। উক্ত প্রতিষ্ঠানটি সংযোগ দেওয়ার জন্য এমন একটি ক্যাবল ব্যবহার করেছে যা আলোর বেগে ডেটা প্রেরণ করে। ফলে মি. সাজিদ সহজেই তার বিভিন্ন ক্লায়েন্টের সাথে ভিডিও কনফারেন্সিং এর মাধ্যমে মিটিং সম্পন্ন করতে পারে।",
    qC: "",
    qD: "উদ্দীপকে মি. সাজিদের মিটিং কার্যক্রমে কোন ধরনের ডেটা ট্রান্সমিশন স্পীড ব্যবহৃত হয়েছে? বিশ্লেষণ কর। (ব্রডব্যান্ড বা Broad Band)"
  }
];
