export const cqs = [
  {
    stem: "ইলা ও আনজুম দুই বান্ধবী মিলে HTML দিয়ে First, Last, Next, Previous লিংকবিশিষ্ট একটি ওয়েবসাইট তৈরি করে। ওয়েবসাইটটি দ্রুত ব্রাউজ করা গেলেও তথ্য নিয়মিত আপডেট করতে সমস্যা হওয়ায় তারা PHP, MySQL ইত্যাদি টুলস দিয়ে ওয়েবসাইটটি পরিবর্তনের সিদ্ধান্ত নেয়।",
    qC: "উদ্দীপকে উল্লিখিত প্রথম ওয়েবসাইটটি কোন ধরনের? এর বৈশিষ্ট্য লিখ। [বরিশাল বোর্ড ২০১৯]",
    qD: "উদ্দীপকে উল্লিখিত সিদ্ধান্তের যৌক্তিকতা বিশ্লেষণ কর।",
  },
  {
    stem: "একটি গাড়ি বিক্রয়কারী প্রতিষ্ঠানের ওয়েবসাইটের হোম পেজে প্রবেশ করলে Sedan এবং SUV ক্যাটাগরির লিংক প্রদর্শিত হয়। গ্রাহকদের মতামত সংগ্রহের জন্য প্রতিষ্ঠানটি তাদের ওয়েবসাইটটি উন্নয়নের সিদ্ধান্ত নিল।",
    qC: "উদ্দীপকের ওয়েবসাইটটি বর্তমানে কোন ধরনের? এর সীমাবদ্ধতা ব্যাখ্যা কর। [ঢাকা বোর্ড ২০২৪]",
    qD: "গ্রাহকদের মতামত সংগ্রহের জন্য ওয়েবসাইটটির উন্নয়নে প্রয়োজনীয় পদক্ষেপগুলো বর্ণনা কর।",
  },
  {
    stem: "একজন ফল ব্যবসায়ী তার প্রতিষ্ঠানের জন্য একটি ওয়েবসাইট তৈরি করে নেয়। যেখানে ফলের বিবরণের জন্য একটি ওয়েবপেজ আছে। তার ওয়েবসাইটের ফলের দাম নিয়মিত আপডেট হয় না। ফলে ক্রেতারা ভুল তথ্য পায়।",
    qC: "উদ্দীপকের ওয়েবসাইটটি কোন ধরনের এবং কেন? [যশোর বোর্ড ২০২৩]",
    qD: "উদ্দীপকের সাপেক্ষে গ্রাহকদের সঠিক তথ্য পেতে ব্যবসায়ীর করণীয় কী? মতামত দাও।",
  },
];
