export const cqs = [
  {
    stem: "ডা. রাজ শহরে অবস্থান করেও প্রত্যন্ত অঞ্চলে সরাসরি চিকিৎসা সেবা দিয়ে থাকেন। তিনি তার বন্ধুর আচিলের অপারেশনে নিম্নতাপমাত্রা প্রয়োগ করে চিকিৎসা করেন এবং তিনি দ্রুত সুস্থ হয়ে বাড়ি ফিরে যান।",
    qC: "ডা. রাজ প্রত্যন্ত অঞ্চলে যে পদ্ধতিতে চিকিৎসা সেবা প্রদান করেন, তার বর্ণনা দাও।",
    qD: "ডা. রাজের বন্ধুর চিকিৎসায় ব্যবহৃত প্রযুক্তিটি সাধারণ শল্যচিকিৎসার চেয়ে কতটা সুবিধাজনক? বিশ্লেষণ কর।"
  },
  {
    stem: "চাঁপাইনবাবগঞ্জ জেলার একজন কৃষক তার জমিতে প্রায় ২০০টি আম গাছ চারা লাগিয়েছেন। তার গাছে এবছর শীতকালে প্রতিটি গাছেই বড় বড় আম ঝুলছে দেখে তিনি খুব খুশি হলেন। তিনি ঘরে বসে ইন্টারনেট ব্যবহার করে আম বিক্রি করে আর্থিকভাবে বেশ লাভবান হলেন।",
    qC: "উদ্দীপকে উল্লিখিত আম বিক্রির প্রক্রিয়াটি বিশ্বগ্রামের কোন উপাদানের সাথে সম্পর্কযুক্ত? ব্যাখ্যা কর।",
    qD: "উক্ত প্রযুক্তি কৃষকের জীবনে এবং দেশের অর্থনীতিতে কী ধরনের ইতিবাচক প্রভাব ফেলতে পারে? বিশ্লেষণ কর।"
  },
  {
    stem: "মিজান বুয়েটে ভর্তির সুযোগ পাওয়ার বিষয়টি ও কলেজের ছবি 3G প্রযুক্তির মাধ্যমে অতি দ্রুত তার বন্ধু-বান্ধব ও আত্মীয়-স্বজনকে জানায়। তাদের কেউ কেউ ভিডিও কল করে অথবা ফেসবুকে তাকে অভিনন্দন জানায়।",
    qC: "মিজানের খবরটি পাঠানোর ক্ষেত্রে বিশ্বগ্রামের কোন উপাদানটি ব্যবহৃত হয়েছে? ব্যাখ্যা কর।",
    qD: "উদ্দীপকে উল্লিখিত প্রযুক্তিটির সাহায্যে যোগাযোগ ছাড়াও বিশ্বগ্রামের আর কী কী সুবিধা পাওয়া সম্ভব? বিশ্লেষণ কর।"
  }
];
