import { CQ } from "../../../ict-syllabus";

export const cqs: CQ[] = [
  {
    "stem": "ইসমাইল সাহেব প্রতিষ্ঠানের হিসাব খাতায় লিখে রাখেন। প্রয়োজনীয় তথ্য সময়মতো না পাওয়ায় ব্যবসায় ক্ষতি হয়।",
    "qA": "DBMS কী? [সমন্বিত বোর্ড ২০১৮]",
    "qB": "DBMS ব্যবহার করলে রিপোর্ট তৈরিতে সুবিধা হয় কেন? [ঢাকা বোর্ড ২০১৭]",
    "qC": "উদ্দীপকের কাজ সহজ করতে কোন সফটওয়্যার দরকার তা ব্যাখ্যা কর। [রাজশাহী বোর্ড ২০১৭]",
    "qD": "DBMS ব্যবহারে প্রতিষ্ঠানের তথ্য ব্যবস্থাপনায় কী পরিবর্তন আসবে তা বিশ্লেষণ কর। [দিনাজপুর বোর্ড ২০১৭]"
  },
  {
    "stem": "একটি সরকারি প্রতিষ্ঠান তথ্য স্বয়ংক্রিয়ভাবে সংরক্ষণে আগ্রহী হয়ে সফটওয়্যার ফার্মের সহায়তায় Oracle ভিত্তিক ব্যবস্থা চালু করল।",
    "qA": "RDBMS কী? [কুমিল্লা বোর্ড ২০১৭]",
    "qB": "বড় প্রতিষ্ঠানে multi-user database দরকার হয় কেন? [চট্টগ্রাম বোর্ড ২০১৭]",
    "qC": "প্রতিষ্ঠানটির জন্য ব্যবহৃত সফটওয়্যারটির ধরন ব্যাখ্যা কর। [সিলেট বোর্ড ২০১৭]",
    "qD": "বর্তমান সিদ্ধান্তের ফলে প্রতিষ্ঠানটি চাহিদামাফিক রিপোর্ট পাবে কি না মূল্যায়ন কর। [বরিশাল বোর্ড ২০১৭]"
  },
  {
    "stem": "ডেটাবেজ তৈরিতে শিক্ষার্থীদের নাম, রোল, সেকশন, জিপিএ ব্যবহার করা হয়। ডেটা আধুনিকীকরণ, রক্ষণাবেক্ষণ ও ব্যবস্থাপনা অনেকগুলো প্রোগ্রামের সাহায্যে সুন্দরভাবে সম্পন্ন হয়।",
    "qA": "ডেটা এনক্রিপশন কী? [ঢাকা বোর্ড ২০১৬]",
    "qB": "বড় আর্থিক প্রতিষ্ঠানের ডেটাবেজ ব্যাখ্যা কর। [রাজশাহী বোর্ড ২০১৬]",
    "qC": "উদ্দীপকের আলোকে ইউনিক ডেটা আইটেম ব্যাখ্যা কর। [দিনাজপুর বোর্ড ২০১৬]",
    "qD": "উদ্দীপকে প্রোগ্রামগুলোর প্রাথমিক কাজ সম্পর্কে মতামত দাও। [কুমিল্লা বোর্ড ২০১৬]"
  }
];
