export const mcqs = [
  {
    q: "অন্যের লেখা বা গবেষণালদ্ধ ফলাফল নিজের নামে চালিয়ে দেয়াকে কী বলা হয়?",
    options: ["কপিরাইট", "সফটওয়্যার পাইরেন্স", "প্লেজিয়ারিজম", "ডেটা পাইরেন্সি"],
    correct: "প্লেজিয়ারিজম",
    explanation: "কোন ব্যক্তি বা প্রতিষ্ঠানের কোন সাহিত্য, গবেষণা বা সম্পাদনা কর্ম হুবহু নকল বা আংশিক পরিবর্তন করে নিজের নামে প্রকাশ করাই হলো প্লেজিয়ারিজম।"
  },
  {
    q: "ইন্টারনেট ব্যবহার করে অনুমতি ব্যতীত অন্যের কম্পিউটার বা কোন নেটওয়ার্কে বা কোন সিস্টেমে অবৈধভাবে অনুপ্রবেশ করাকে কি বলা হয়?",
    options: ["হ্যাকিং", "স্ক্যানিং", "সাইবার-আক্রমণ", "প্লেজারিজম"],
    correct: "হ্যাকিং",
    explanation: "সাধারণত হ্যাকিং একটি প্রক্রিয়া যার মাধ্যমে কেউ কোন বৈধ অনুমতি ব্যতীত কোন কম্পিউটার বা কম্পিউটার নেটওয়ার্কে প্রবেশ করে।"
  },
  {
    q: "ইন্টারনেটকে কেন্দ্র করে যে সকল ক্রাইম সংঘটিত হয় তাকে কী বলে?",
    options: ["ইন্টারনেট ক্রাইম", "সাইবার ক্রাইম", "ভাইরাস", "প্লেজারিজম"],
    correct: "সাইবার ক্রাইম",
    explanation: "ইন্টারনেটকে কেন্দ্র করে যে সকল কম্পিউটার ক্রাইম সংঘটিত হয় তাদেরকে সাইবার ক্রাইম বুঝায়।"
  },
  {
    q: "তথ্য নিরাপত্তা ব্যবস্থায় যেসব পদক্ষেপ নেয়া জরুরি সেগুলো হলো- i. অ্যাকসেস কন্ট্রোল ii. এন্টিভাইরাস ব্যবহার iii. সিকিউরিটি মনিটরিং সফটওয়্যার ব্যবহার করা",
    options: ["i ও ii", "i ও iii", "ii ও iii", "i, ii ও iii"],
    correct: "i, ii ও iii",
    explanation: "তথ্য সুরক্ষার জন্য সিস্টেমের অ্যাক্সেস কন্ট্রোল, অ্যান্টিভাইরাস এবং সিকিউরিটি মনিটরিং সবগুলোই অত্যন্ত জরুরি।"
  },
  {
    q: "VIRUS এর পূর্ণরূপ কী?",
    options: ["Virtual Information Resources Under seize", "Visual Information Resources Under size", "Video Information Resources Under Siege", "Vital Information Resources Under Seize"],
    correct: "Vital Information Resources Under Seize",
    explanation: "কম্পিউটার ভাইরাসের পূর্ণরূপ হলো Vital Information Resources Under Seize, যার অর্থ গুরুত্বপূর্ণ তথ্যসমূহ বাজেয়াপ্ত করা।"
  }
];
