export const cqs = [
  {
    stem: "রহিম সাহেব তার অফিসে এমন একটি ইলেকট্রনিক ডিভাইস বসালেন, যার মাধ্যমে তিনি পাসওয়ার্ড (অঙ্ক বা বর্ণ) দিলে ডিভাইসটি তা নিজে নিজে বাইনারি কোডে রূপান্তর করে মূল সিস্টেমে পাঠায়। কিন্তু সিস্টেম থেকে যখন মেসেজ আসে, তখন অন্য একটি ডিভাইসের মাধ্যমে তা আবার মানুষের বোধগম্য ভাষায় স্ক্রিনে প্রদর্শিত হয়।",
    qC: "রহিম সাহেবের পাসওয়ার্ড এন্ট্রি করার ডিভাইসটি যে লজিক সার্কিটের নীতিতে কাজ করে, তার সত্যক সারণি ও লজিক ফাংশন লেখ (যদি ৮টি ইনপুট হয়)।",
    qD: "উক্ত সার্কিটটির আউটপুট ফাংশনগুলো মৌলিক গেইট দিয়ে বাস্তবায়ন করে সার্কিট ডায়াগ্রাম অঙ্কন কর এবং এর গুরুত্ব বিশ্লেষণ কর।"
  }
];
