export const cqs = [
  {
    stem: "প্রতিষ্ঠানের মালিক রাকিব সাহেব দেশের বাইরে অবস্থান করায় তিনি তাঁর অফিসের কর্মচারীদের সাথে একটি ভিডিও কনফারেন্সের প্রয়োজন অনুভব করলেন। কিন্তু কর্মচারী শফিক সাহেবের কাছে ইন্টারনেটের সুবিধাসহ মোবাইল ফোন থাকলেও ভিডিও কনফারেন্সিং প্রযুক্তির সুবিধা নেই। তাই তিনি ভিডিও কনফারেন্সিং সুবিধা সম্বলিত একটি মোবাইল ফোন ক্রয় করলেন। তবে মোবাইল ফোন ক্রয়ের পর জানতে পারলেন যে, বর্তমানে বাজারে MIMO সুবিধা সম্বলিত আরো উচ্চ প্রযুক্তির মোবাইল ফোন রয়েছে।",
    qC: "শফিক সাহেব যে ফোনটি ক্রয় করলেন তার প্রযুক্তিগত বৈশিষ্ট্য ব্যাখ্যা কর।",
    qD: "শফিক সাহেব পূর্বে যে ফোনটি ব্যবহার করতেন এবং নতুন ফোনটি ক্রয়ের পরে বাজারে যে আরো উন্নত প্রযুক্তি-সম্বলিত ফোন দেখতে পেলেন তাদের প্রযুক্তিগত পার্থক্য বিশ্লেষণ কর।"
  },
  {
    stem: "দোলনচাঁপা ও তার বাবা ভিন্ন ভিন্ন প্রজন্মের মোবাইল ফোন নিয়ে আলাপ করছেন। দোলনচাঁপার বাবা পূর্বে যে মোবাইলটি ব্যবহার করতেন, সেটি আকারে একটু বড় হলেও ঐ মোবাইল ফোন দিয়ে ইন্টারনেট ব্যবহার করা যেতো না। দোলনচাঁপা বলল, বর্তমানে আমরা ইন্টারনেটের মাধ্যমে বিশ্বব্যাপী কিছু সুবিধা বা পরিসেবা গ্রহণ করতে পারি।",
    qC: "উদ্দীপকে দোলনচাঁপার বাবার মোবাইল ফোনটি কোন প্রজন্মের সেটির বৈশিষ্ট্যসমূহ ব্যাখ্যা কর।",
    qD: "দোলনচাঁপার বর্তমান মোবাইল ফোনের প্রজন্মের সাথে তার বাবার মোবাইল প্রজন্মের তুলনামূলক বিশ্লেষণ কর।"
  },
  {
    stem: "মি. দিদারের অফিসের পত্রাদি অ্যাটাচমেন্ট হিসাবে ই-মেইলের মাধ্যমে প্রাপকের কাছে পাঠানো হয়। তার অফিসের সহকর্মীরা WCDMA (3G) স্ট্যান্ডার্ডের মোবাইলের মাধ্যমে ভিডিও চ্যাট করে থাকেন। অন্যদিকে বর্তমানে অনেকে IP নির্ভর নেটওয়ার্ক ব্যবহার করে লাইভ স্ট্রিমিং করেন।",
    qC: "উদ্দীপকে উল্লিখিত সহকর্মীদের মোবাইল প্রজন্মটির বৈশিষ্ট্য ব্যাখ্যা কর।",
    qD: "অফিসের সহকর্মীদের ব্যবহৃত প্রজন্মের সাথে বর্তমান IP নির্ভর প্রজন্মের তুলনামূলক বিশ্লেষণ কর।"
  },
  {
    stem: "জনাব 'ক' এর মোবাইলটি LTE (Long Term Evolution) স্ট্যান্ডার্ডে কাজ করে থাকে। জনাব 'ক' তাঁর মোবাইলে ধারণকৃত কিছু ছবি IEEE 802.15 স্ট্যান্ডার্ডের একটি বিশেষ প্রোটোকল ব্যবহার করে তাঁর বন্ধু জনাব 'খ' এর মোবাইলে প্রেরণ করেন।",
    qC: "জনাব 'ক' এর মোবাইলটি কোন প্রজন্মের? এর বৈশিষ্ট্যগুলো লেখ।",
    qD: "উদ্দীপকে উল্লিখিত ছবি প্রেরণের ক্ষেত্রে যে ধরনের নেটওয়ার্কটি ব্যবহৃত হয়েছে তা স্বল্প দূরত্বে কার্যকরী হলেও অধিক দূরত্বের ক্ষেত্রে উপযোগী নয়- মতামত দাও।"
  }
];
