export const cqs = [
  {
    stem: "করিম তার বন্ধুর কাছে একটি ই-মেইল বার্তা প্রেরণ করার জন্য একটি ডকুমেন্ট প্রস্তুত করল। ডকুমেন্টটিতে মোট ১০৩০ টি ক্যারেক্টার রয়েছে। তিনি ডকুমেন্টটিকে অ্যাসিনক্রোনাস পদ্ধতিতে পাঠালেন যেখানে ট্রান্সমিশনের গতি ছিল 4kbps.",
    qC: "করিম এর ডকুমেন্টটি পাঠাতে মোট কত সময় লাগবে তা নির্ণয় কর।",
    qD: "উদ্দীপকে উল্লিখিত গতিতে যদি সিনক্রোনাস পদ্ধতিতে ইমেইলটি পাঠানো হয় তবে তার দক্ষতা বেশি হবে বিষয়টি বিশ্লেষণপূর্বক তোমার মতামত দাও।"
  },
  {
    stem: "আইসিটি শিক্ষক ক্লাসে ক্যারেক্টার বাই ক্যারেক্টার ডেটা ট্রান্সমিশন শেখাচ্ছেন। মনির আইসিটি স্যারের কাছে ব্লক আকারে সমান বিরতিতে ডেটা ট্রান্সমিশন সম্পর্কে জানতে চাইলো। সাদিয়া আলোর গতিতে ডেটা ট্রান্সমিট হয় এমন ক্যাবল দিয়ে বাসায় ইন্টারনেট সংযোগ নিয়ে ইউটিউব দেখে ডেটা ট্রান্সমিশনের পদ্ধতি সম্পর্কে অধিকতর জ্ঞান অর্জন করলো। [ঢা. বো. ২৪]",
    qC: "মনিরের জানতে চাওয়া ডেটা ট্রান্সমিশন মেথডটির বর্ণনা দাও।",
    qD: "উদ্দীপকে উল্লিখিত ট্রান্সমিশন মেথড দুইটির মধ্যে কোনটির দক্ষতা বেশি তা বিশ্লেষণপূর্বক মতামত দাও।"
  },
  {
    stem: "রাজ আইসিটি ক্লাসে শিক্ষকের আলোচনা হতে জানতে পারে যে, ডেটা কমিউনিকেশনে একটি পদ্ধতিতে ডেটা ক্যারেক্টার বাই ক্যারেক্টার ট্রান্সমিট হয় এবং অপর একটি পদ্ধতিতে ডেটা ব্লক আকারে ট্রান্সমিট হয়। সে তার বাসায় তারবিহীন ইন্টারনেট সংযোগ নেয় ফলে সে দ্রুত গতির ইন্টারনেট ব্যবহার করতে পারে। [য. বো. ১৯]",
    qC: "উদ্দীপকে উল্লিখিত তারবিহীন ইন্টারনেট সংযোগের মাধ্যমটি সম্পর্কে ব্যাখ্যা কর।",
    qD: "উদ্দীপকে ট্রান্সমিশন পদ্ধতি দু'টির মধ্যে কোনটির দক্ষতা বেশি? বিশ্লেষণপূর্বক মতামত দাও।"
  },
  {
    stem: "আইসিটি শিক্ষক ক্লাসে বললেন ডেটা ট্রান্সমিশনের একটি পদ্ধতিতে ডেটা একটি তারের মধ্যে দিয়ে স্টার্ট ও স্টপ বিটের সমন্বয়ে প্যাকেট আকারে ট্রান্সমিট হয় এবং অপর একটি পদ্ধতিতে ডেটা ফ্রেমের সাথে হেডার ও ট্রেইলার যুক্ত হয়ে ট্রান্সমিট হয়। [কু. বো. ২৩]",
    qC: "উদ্দীপকে উল্লিখিত ১ম ডেটা ট্রান্সমিশন পদ্ধতিটি ব্যাখ্যা কর।",
    qD: "উদ্দীপকে উল্লিখিত ডেটা ট্রান্সমিশনের পদ্ধতি দুটোর মধ্যে তুলনামূলক বিশ্লেষণ কর।"
  }
];
