export const cqs = [
  {
    stem: "একটি বিশ্ববিদ্যালয়ের আইটি অফিসার বিভিন্ন বিভাগের মধ্যে টুইস্টেড পেয়ার ক্যাবল ব্যবহার করে একটি নেটওয়ার্ক তৈরি করলেন। কিন্তু নেটওয়ার্কে ডেটা স্থানান্তর ধীরগতি সম্পন্ন হওয়ায় তিনি ঠিকমতো কাজ করতে পারছেন না। তাই তিনি নেটওয়ার্ক ক্যাবল পরিবর্তন করে ফাইবার অপটিক ক্যাবল ব্যবহারের চিন্তাভাবনা করছেন।",
    qC: "উদ্দীপকে উল্লিখিত নেটওয়ার্ক সমস্যার কারণ চিহ্নিতপূর্বক ব্যাখ্যা কর।",
    qD: "আইটি অফিসারের সিদ্ধান্ত কতটুকু যুক্তিযুক্ত? মূল্যায়ন কর।"
  },
  {
    stem: "আফনান ও সাফনান দুই ভাই। আফনান তথ্য আদান-প্রদানের জন্য এক ধরনের ক্যাবল ব্যবহার করে যার মধ্যে ৪টি কমন রঙের (সাদা) তার রয়েছে এবং সাফনান তথ্য স্থানান্তরে বিশেষভাবে তৈরি পরিশুদ্ধ কাঁচের অত্যন্ত সুক্ষ্ম তন্তুবিশিষ্ট ক্যাবল ব্যবহার করে। অন্যদিকে আফনানের বন্ধু রাফসান তথ্য আদান-প্রদানের জন্য এমন এক ধরনের ক্যাবল ব্যবহার করে যা ডিজিটাল ও এনালগ উভয় ধরনের ডেটা আদান-প্রদানে সক্ষম এবং ক্যাবল টিভি নেটওয়ার্কে ব্যবহৃত হয়। [সিলেট বোর্ড- ২০২৩]",
    qC: "তথ্য আদান-প্রদানে আফনানের ব্যবহৃত ক্যাবলটি ব্যাখ্যা কর।",
    qD: "তথ্য স্থানান্তরে সাফনান ও রাফসানের ব্যবহৃত ক্যাবলের তুলনামূলক বিশ্লেষণ কর।"
  },
  {
    stem: "আইসিটি নির্ভর জ্ঞান ও প্রযুক্তি মানুষকে সমৃদ্ধির পথে এগিয়ে নিচ্ছে। আরিফ আইসিটি বিষয়ে পড়াশুনা করে এমন একটি যোগাযোগ মাধ্যম সম্পর্কে জানতে পারল যেখানে শব্দের পাশাপাশি চলমান ছবিও পাঠানো যায়। তবে এ মাধ্যমে ডেটা বাঁকা পথে চলাচল করতে পারে না বিধায় উঁচু ভবনের উপর টাওয়ার বসানোর প্রয়োজন হয়। পরবর্তীতে নতুন উদ্ভাবিত একটি প্রযুক্তির সাথে এর সম্মিলন ঘটানো হয়, যা সমুদ্রের তলদেশ দিয়ে এক মহাদেশকে অন্য মহাদেশের সাথে যুক্ত করেছে। [বরিশাল বোর্ড ১৭]",
    qC: "উদ্দীপকের প্রথম মাধ্যমটি ব্যাখ্যা কর।",
    qD: "‘দ্বিতীয় মাধ্যমটি প্রথম মাধ্যম অপেক্ষাকৃত সুবিধাজনক’- যুক্তিসহ মূল্যায়ন কর।"
  },
  {
    stem: "মি. সাজিদ “বিডিরেন” নামক একটি প্রতিষ্ঠান থেকে ইন্টারনেট সংযোগ নিয়েছে। উক্ত প্রতিষ্ঠানটি সংযোগ দেওয়ার জন্য এমন একটি ক্যাবল ব্যবহার করেছে যা আলোর বেগে ডেটা প্রেরণ করে। ফলে মি. সাজিদ সহজেই তার বিভিন্ন ক্লায়েন্টের সাথে ভিডিও কনফারেন্সিং এর মাধ্যমে মিটিং সম্পন্ন করতে পারে।",
    qC: "উদ্দীপকে মি. সাজিদের সংযোগে কোন ধরনের ক্যাবল ব্যবহৃত হয়েছে? এর গঠন বর্ণনা কর।",
    qD: "উক্ত ক্যাবলটি ডেটা সংরক্ষণের নিরাপত্তা ও গোপনীয়তা রক্ষায় কীভাবে ভূমিকা রাখে তা বিশ্লেষণ কর।"
  },
  {
    stem: "আসাদ সাহেব তাঁর অফিসের কম্পিউটারগুলোর মধ্যে নেটওয়ার্ক স্থাপনের ক্ষেত্রে এমন এক ধরনের তার ব্যবহার করলেন যা বাঁকালে ডেটা লস হয়। [চট্টগ্রাম বোর্ড ২০২৪]",
    qC: "উদ্দীপকে উল্লিখিত তারটির গঠন ব্যাখ্যা কর।",
    qD: "উদ্দীপকের তারটি লোকাল এরিয়া নেটওয়ার্কে ব্যবহারের যৌক্তিকতা বিশ্লেষণ কর।"
  },
  {
    stem: "'ক' কলেজের প্রশাসনিক ভবন, একাডেমিক ভবন, লাইব্রেরী ভবন এবং অন্যান্য কাজে ব্যবহৃত ভবনগুলো নিজস্ব নেটওয়ার্ক ব্যবস্থায় পারস্পরিক তথ্য আদান-প্রদান করতে পারে। অধ্যক্ষ মহোদয় এখন সকল কম্পিউটারকে একই নেটওয়ার্কের আওতায় আনার পরিকল্পনা গ্রহণ করলেন এবং তিনি চাচ্ছেন খরচ যেন সবচেয়ে কম হয়। [ঢাকা বোর্ড-২০২৩]",
    qC: "কলেজের বর্তমান নেটওয়ার্কটি কোন ধরনের ট্রান্সমিশন ব্যবহার করছে তা ব্যাখ্যা কর।",
    qD: "অধ্যক্ষ মহোদয়ের পরিকল্পনা সবচেয়ে কম খরচে বাস্তবায়নের জন্য কোন ট্রান্সমিশন মিডিয়াটি উত্তম? যৌক্তিক ব্যাখ্যা দাও।"
  }
];
