export const cqs = [
  {
    stem: "বাসার সাহেব কম্পিউটার মেলায় গিয়ে একটি হার্ডডিস্ক কিনলেন। হার্ডডিস্কটি আকারে খুব ছোট কিন্তু এর ধারণক্ষমতা অনেক বেশি। তিনি বন্ধু প্রিন্সকে হার্ডডিস্কটি দেখানোর জন্য তাঁর অফিসে গেলেন। প্রিন্সের অফিসে গিয়ে দেখলেন উক্ত অফিসের কর্মকর্তা- কর্মচারীগণ একটি যন্ত্রের দিকে তাকালেই অফিসের দরজা খুলে যাচ্ছে। [চট্টগ্রাম বোর্ড ২০২৪]",
    qC: "উদ্দীপকে উল্লিখিত ডিভাইসটি (হার্ডডিস্ক) তৈরির প্রযুক্তি ব্যাখ্যা কর।",
    qD: ""
  },
  {
    stem: "ডাঃ রাজিব মেডিকেল কলেজের ব্যবহারিক ক্লাসে রোগী ছাড়াই বিশেষ প্রযুক্তির মাধ্যমে হার্টের অপারেশনের অভিজ্ঞতা লাভ করেন। তিনি লং টেনিস খেলতে গিয়ে লক্ষ্য করলেন অন্যান্য বলের তুলনায় এ বলের স্থায়ীত্ব অনেক বেশি। [যশোর বোর্ড ২০২৩]",
    qC: "উদ্দীপকের বলটি তৈরির প্রযুক্তিটি (ন্যানোটেকনোলজি) ব্যাখ্যা কর।",
    qD: ""
  },
  {
    stem: "একজন যন্ত্র প্রকৌশলী বিশেষ প্রযুক্তির মাধ্যমে একটি মেমরি ডিভাইস তৈরি করেছেন যা আকারে ছোট কিন্তু তথ্য ধারণ ক্ষমতা বেশি। তিনি ডিভাইসটি উন্নত করার জন্য আরও একটি বিশেষ প্রযুক্তির সাহায্যে কাল্পনিক ত্রি-মাত্রিক মডেল তৈরি করলেন। [দিনাজপুর বোর্ড ২০২৩]",
    qC: "উদ্দীপকে উল্লিখিত মেমরি ডিভাইস তৈরির প্রযুক্তিটি বর্ণনা কর।",
    qD: ""
  },
  {
    stem: "সেনাপ্রধান সিদ্ধান্ত নিলেন যে, সৈনিকদের প্রযুক্তিনির্ভর পরিবেশে যুদ্ধের প্রশিক্ষণ দেওয়া হবে, যাতে সৈনিকগণ অভিজ্ঞতা লাভ করে। তিনি খাদ্য সরবরাহ ইউনিটকে যুদ্ধের ময়দানে দীর্ঘদিন সতেজ ও মচমচে থাকে এমন পদ্ধতিতে শুকনো খাবার সরবরাহ করার নির্দেশ দিলেন। [ময়মনসিংহ বোর্ড ২০১৮]",
    qC: "উদ্দীপকে যুদ্ধের ময়দানে খাবার সরবরাহের প্রযুক্তি (ন্যানোটেকনোলজি) ব্যাখ্যা কর।",
    qD: ""
  }
];
