export const cqs = [
  {
    stem: "সুমন, রানা ও সুজন বাজারে গিয়ে যথাক্রমে (100110)₂, (46)₈ এবং (2F)₁₆ টাকার জিনিস কিনল।",
    qC: "রানা ও সুজনের মধ্যে কে বেশি টাকার জিনিস কিনেছে তা গাণিতিকভাবে বিশ্লেষণ কর।",
    qD: "তারা তিনজন একত্রে মোট কত টাকার জিনিস কিনেছে তা অক্টাল সংখ্যা পদ্ধতিতে নির্ণয় কর।"
  },
  {
    stem: "আইসিটি শিক্ষক শিক্ষার্থীদের দুটি সংখ্যা (A5)₁₆ এবং (125)₈ দিলেন। তিনি বললেন, প্রথম সংখ্যাটি থেকে দ্বিতীয় সংখ্যাটি বিয়োগ করা সম্ভব এবং তা শুধু যোগের মাধ্যমেও করা যায়।",
    qC: "দ্বিতীয় সংখ্যাটিকে বাইনারিতে রূপান্তর কর।",
    qD: "শিক্ষকের উক্তি অনুযায়ী শুধু যোগের মাধ্যমে (২-এর পরিপূরক পদ্ধতি ব্যবহার করে) প্রথম সংখ্যা থেকে দ্বিতীয় সংখ্যা বিয়োগ করে দেখাও।"
  }
];
