export const cqs = [
  {
    stem: "শ্রেণিকক্ষে আইসিটি শিক্ষক এমন একটি নেটওয়ার্কিং ডিভাইস সম্পর্কে ধারণা দেন যেখানে একটি কেন্দ্রীয় ডিভাইস ব্যবহৃত হয় যা প্রাপ্ত সিগন্যাল নির্দিষ্ট প্রাপক ডিভাইসেই প্রেরণে সক্ষম। পরবর্তীতে তিনি আরেক ধরনের নেটওয়ার্কিং ডিভাইসের ধারণা দেন যা প্রাপ্ত ডেটা নেটওয়ার্কে যুক্ত সকল ডিভাইসে পাঠিয়ে দেয়।",
    qC: "উদ্দীপকে উল্লিখিত প্রথম কেন্দ্রীয় ডিভাইসের কার্যাবলি ব্যাখ্যা কর।",
    qD: "উদ্দীপকের ডিভাইস দুটির (সুইচ ও হাব) মধ্যে কোনটি ব্যবহার করা অধিক সুবিধাজনক? বিশ্লেষণপূর্বক মতামত দাও।"
  },
  {
    stem: "মি. সাব্বির তার অফিসের বিভিন্ন রুমের ৪ টি কম্পিউটারকে একটি কেন্দ্রীয় ডিভাইসের মাধ্যমে একটি লোকাল নেটওয়ার্কে নিয়ে এলেন যা ডেটা ব্রডকাস্ট করে থাকে। কিছুদিন পর তিনি কোম্পানির অন্য একটি শাখার ভিন্ন প্রোটোকলের একটি নেটওয়ার্কের সাথে নিজের অফিসের নেটওয়ার্ক যুক্ত করার প্রয়োজনীয়তা অনুভব করলেন।",
    qC: "মি. সাব্বিরের অফিসের ৪টি কম্পিউটার যুক্ত করতে কোন ধরনের নেটওয়ার্ক ডিভাইস ব্যবহৃত হয়েছে? ব্যাখ্যা কর।",
    qD: "ভিন্ন প্রোটোকলের দুই শাখার নেটওয়ার্ককে সংযুক্ত করার জন্য মি. সাব্বিরকে কোন ডিভাইস নির্বাচন করতে হবে? তার যৌক্তিকতা বিশ্লেষণ কর।"
  },
  {
    stem: "একটি কলেজের কম্পিউটার ল্যাবের কম্পিউটারগুলোর মধ্যে ডেটা স্থানান্তরের সময় প্রায়ই ডেটার সংঘর্ষ (Collision) হয় এবং ট্রাফিক বেড়ে যায়, কারণ তাদের ব্যবহৃত কেন্দ্রীয় ডিভাইস ডেটা সিগন্যাল সবাইকে পাঠিয়ে দেয়। ল্যাব অ্যাসিস্ট্যান্ট এর পরিবর্তে এমন একটি ডিভাইস ব্যবহারের পরামর্শ দিলেন যা প্রেরকের তথ্য শুধু নির্দিষ্ট প্রাপকের কাছেই পৌঁছাবে।",
    qC: "ল্যাবে বর্তমানে ব্যবহৃত নেটওয়ার্ক ডিভাইসের বৈশিষ্ট্য ব্যাখ্যা কর।",
    qD: "ল্যাব অ্যাসিস্ট্যান্টের প্রস্তাবিত ডিভাইসটির কার্যপদ্ধতি ল্যাবের বর্তমান সমস্যা সমাধানে কীভাবে সাহায্য করবে? বিশ্লেষণ কর।"
  }
];
