export const cqs = [
  {
    stem: "ফলের নাম: আপেল, মূল্য (প্রতি পিস): (12.75)₁₀\nফলের নাম: কমলা, মূল্য (প্রতি পিস): (32.2)₈\nফলের নাম: নাশপাতি, মূল্য (প্রতি পিস): (2C)₁₆\nফলের নাম: ড্রাগন, মূল্য (প্রতি পিস): (10010)₂",
    qC: "উদ্দীপকের চার্ট থেকে আপেল ও ড্রাগন ফলের মূল্যের যোগফল বাইনারিতে নির্ণয় কর।",
    qD: "আপেল, কমলা এবং নাশপাতির মোট মূল্য কত তা দশমিক সংখ্যা পদ্ধতিতে বিশ্লেষণ কর।"
  },
  {
    stem: "মামুন জয়পুরহাট থেকে ঢাকা যাওয়ার জন্য (112)₈ টাকায় টিকিট কিনল। মামুনের বন্ধু আবির নারায়ণগঞ্জ থেকে ঢাকা আসার জন্য (3D)₁₆ টাকায় টিকিট কিনল।",
    qC: "মামুন ও আবির মোট কত টাকার টিকিট ক্রয় করল তা বাইনারিতে প্রকাশ কর।",
    qD: "মামুন ও আবিরের টিকিটের মূল্যের মধ্যে কে বেশি টাকা খরচ করেছে তা দশমিক সংখ্যা পদ্ধতিতে বিশ্লেষণ কর।"
  }
];
