export const cqs = [
  {
    stem: "রফিক ও শফিক দুই বন্ধু হাঁটতে হাঁটতে থানার দিকে যাচ্ছিল। তারা লক্ষ্য করল সামনে দাঁড়িয়ে একজন পুলিশ একটি ডিভাইস-এর মাধ্যমে কথা বলছে এবং কথা বলা শেষ হলে অপর পক্ষকে কথা বলার সিগনাল দিচ্ছে। একটু সামনে এগোতেই শফিক তার সাথে থাকা ডিভাইসের মাধ্যমে কথা বলে এবং শোনে। রফিক বলল, “চল বাসায় ফেরা যাক। আমি রেডিওতে আবহাওয়া বার্তায় শুনেছি আজ বৃষ্টি হতে পারে।”",
    qC: "পুলিশের ব্যবহৃত ডিভাইসটির ডেটা ট্রান্সমিশন মোড-এর ধরন ব্যাখ্যা কর।",
    qD: "রফিক ও শফিকের ব্যবহৃত ডিভাইসদ্বয়ের মধ্যে কোনটির ডেটা ট্রান্সমিশন মোড বেশি সুবিধাজনক? বিশ্লেষণপূর্বক মতামত দাও।"
  },
  {
    stem: "মি. ‘X’ কম্পিউটারে বসে একটি ব্রাউজার ওপেন করে প্রথমে তার অ্যাড্রেস বারে একটি অ্যাড্রেস লিখে এন্টার চাপল। ফলে একটি মেইল সার্ভিস ওপেন হলো। তারপর সে মেইল সার্ভিস থেকে একটা অ্যাটাচমেন্ট ফাইল ডাউনলোড করলো। [রাজশাহী বোর্ড ১৭]",
    qC: "মি. ‘X’ এর ফাইল ডাউনলোড করার ক্ষেত্রে ডেটা ডেলিভারি মোড কোনটি? ব্যাখ্যা কর।",
    qD: "মি. ‘X’ এর কোন কোন কাজে কী কী ধরনের ডেটা ট্রান্সমিশন মোড ও মেথড ব্যবহৃত হয়েছে তা বিশ্লেষণ কর।"
  },
  {
    stem: "মিলির বাসায় ডিশ সংযোগ রয়েছে। তার বাসায় টেলিভিশনে কীভাবে ডেটা সম্প্রচার হয় তা তার বড় ভাই তুহিন মিলিকে বুঝিয়ে বললো। তুহিন মিলিকে নেটওয়ার্কিং এর জন্য এক ধরনের ক্যাবলের গুরুত্বের কথা বললো যার মাধ্যমে আলোর গতিতে ডেটা ট্রান্সফার হয়। [কুমিল্লা বোর্ড ২০২৪]",
    qC: "মিলির বাসায় ডেটা ট্রান্সমিশন মোড ব্যাখ্যা কর।",
    qD: "উদ্দীপকে উল্লিখিত ক্যাবলটির সুবিধা অন্যান্য ক্যাবলের তুলনায় অধিক—বিশ্লেষণ কর।"
  },
  {
    stem: "জারিফ ও জায়ান একাদশ শ্রেণির ছাত্র। তাদের শিক্ষার মান উন্নয়নে ICT শিক্ষকের পরামর্শে ল্যাপটপ ও ইন্টারনেট সংযোগ নেয়। বাড়িতে টেলিভিশন না থাকায় মাঝে মাঝে বাড়ির সকলে মিলে বিভিন্ন অনুষ্ঠান ও ক্রিকেট খেলা ল্যাপটপেই দেখে। কিছুদিন পর দেখা গেল ইন্টারনেট সংযোগ থাকার কারণে জারিফের রেজাল্ট বেশ ভালো হয় কিন্তু জায়ান পিছিয়ে পড়ে। [দিনাজপুর বোর্ড ১৭]",
    qC: "উদ্দীপকের আলোকে অনুষ্ঠান ও ক্রিকেট খেলায় ব্যবহৃত ডেটা আদান প্রদানের মোড ব্যাখ্যা কর।",
    qD: "ইন্টারনেটের সঠিক ব্যবহারই জারিফ ও জায়ানের ফলাফলের পার্থক্যের কারণ—বিশ্লেষণ কর।"
  },
  {
    stem: "মি. দিদারের অফিসের পত্রাদি অ্যাটাচমেন্ট হিসাবে ই-মেইলের মাধ্যমে প্রাপকের কাছে পাঠানো হয়। তার অফিসের সহকর্মীরা WCDMA স্ট্যান্ডার্ডের মোবাইলের মাধ্যমে ভিডিও চ্যাট করে থাকেন। [বরিশাল বোর্ড-২০১৯]",
    qC: "উদ্দীপকে পত্র পাঠানোর ট্রান্সমিশন মোড ব্যাখ্যা কর।",
    qD: "সহকর্মীদের ভিডিও চ্যাটের ডেলিভারি মোড বিশ্লেষণ কর।"
  },
  {
    stem: "টেলিভিশনে বিশ্বকাপ ফুটবল খেলা দেখতে রাহাত তার বন্ধুর বাড়িতে যায়। খেলাশেষে ফেরার পথে সে দেখল রাস্তায় একটি ট্রাক এক্সিডেন্ট করেছে। ট্রাকের সামনে একজন পুলিশ অফিসার দাঁড়িয়ে মোবাইল সদৃশ একটি ডিভাইস ব্যবহার করে থেমে থেমে কথা বলছিলেন। এমন সময় রাহাতের বন্ধু রেজা মোবাইল ফোনে জানতে চাইল খেলায় কোন দেশ জিতেছে। রাহাত উত্তর দিল জার্মানি। [চট্টগ্রাম বোর্ড ১৭]",
    qC: "উদ্দীপকের পুলিশ অফিসারের ডিভাইসটিতে ডেটা আদান প্রদানের জন্য কোন পদ্ধতিটি ব্যবহার করা হচ্ছিল- বিশ্লেষণ কর।",
    qD: "রাহাতের টেলিভিশনে খেলা দেখা এবং খেলার ফলাফল বন্ধুকে জানিয়ে দেওয়ার ক্ষেত্রে ডিভাইস দুটিতে ডেটা ট্রান্সমিশন পদ্ধতির কি কোনো বৈসাদৃশ্য আছে? উদ্দীপকের আলোকে ব্যাখ্যা কর।"
  }
];
