import { CQ } from "../../../ict-syllabus";

export const cqs: CQ[] = [
  {
    "stem": "একটি কলেজে ছাত্রদের নাম, রোল, জন্মতারিখ, শ্রেণি ও গ্রুপ সংরক্ষণের জন্য একটি টেবিল তৈরি করা হলো।",
    "qA": "ডেটাবেজ কী? [ঢাকা বোর্ড ২০১৯]",
    "qB": "মেমো ডেটা টাইপ কেন ব্যবহার করা হয়? [রাজশাহী বোর্ড ২০১৯]",
    "qC": "টেবিলের কলাম ও সারিকে ডেটাবেজের ভাষায় কী বলা হয় তা ব্যাখ্যা কর। [দিনাজপুর বোর্ড ২০১৯]",
    "qD": "এই টেবিল ব্যবহারে কলেজ কর্তৃপক্ষ কী সুবিধা ও সীমাবদ্ধতা পেতে পারে তা বিশ্লেষণ কর। [কুমিল্লা বোর্ড ২০১৯]"
  },
  {
    "stem": "শফিক সিলেটের হোটেলগুলোর নাম, ঠিকানা, রুমের সংখ্যা, সর্বোচ্চ-সর্বনিম্ন ভাড়া ও ফোন নম্বর নিয়ে www.hotel.bd সাইটের জন্য ডেটাবেজ তৈরির পরিকল্পনা করল।",
    "qA": "ফাংশন কী? [চট্টগ্রাম বোর্ড ২০১৯]",
    "qB": "ডিবাগিং কেন গুরুত্বপূর্ণ? [সিলেট বোর্ড ২০১৯]",
    "qC": "শফিকের পরিকল্পনার মতো একটি নমুনা ডেটাবেজ টেবিল তৈরি কর। [বরিশাল বোর্ড ২০১৯]",
    "qD": "ডেটাবেজটি পর্যটকদের জন্য কতটা সহায়ক হবে তা মূল্যায়ন কর। [মাদরাসা বোর্ড ২০১৯]"
  }
];
